Tekla Open API Reference for Tekla Structures 2025
MaterialItemEnumerator Class
 The MaterialItemEnumerator class allows to loop through the catalog material items.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.MaterialItemEnumerator
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class MaterialItemEnumerator : IEnumerator
<SerializableAttribute>
Public NotInheritable Class MaterialItemEnumerator
	Implements IEnumerator
The MaterialItemEnumerator type exposes the following members.
Properties
Name | Description
Current
 Returns a material item instance of the current element.
Top
Methods
Name | Description
GetSize
 Returns the total amout of items.
MoveNext
 Moves to the next item in the enumerator.
Reset
 Resets the enumerator to the beginning.
Top
Examples
 The following example returns true if an item with the name S235JR has been found:
using Tekla.Structures.Catalogs;
public class Example
{
       public bool Example1()
       {
           bool Result = false;
           CatalogHandler CatalogHandler = new CatalogHandler();
           if (CatalogHandler.GetConnectionStatus())
           {
               MaterialItemEnumerator MaterialItemEnumerator = CatalogHandler.GetMaterialItems();
               while (MaterialItemEnumerator.MoveNext())
               {
                   MaterialItem MaterialItem = MaterialItemEnumerator.Current as MaterialItem;
                   if (MaterialItem.MaterialName == "S235JR")
                   {
                       Result = true;
                       break;
                   }
               }
           }
           return Result;
       }
}
See Also
Reference
Tekla.Structures.Catalogs Namespace